import React from 'react';
import Breadcrumb from './common/Breadcrumb';
import Footer from './common/Footer';
import Header from './common/Header';

const Privacy = () => {

    return (
        <>
            <Header />
            <div className="services-details-area pt-140 pb-105">
                <div className="container">
                    <div className="row">
                        <div className="col-xl-12">
                            <h4 className="services-d-title mb-25">Политика конфиденциальности</h4>
                            <h5 className="services-sm-title mb-25">СОГЛАСИЕ</h5>
                            <p>Если вы не согласны с условиями настоящей Политики конфиденциальности, не посещайте и не используйте веб-сайты EPAM. Если вы хотите прекратить получать маркетинговые материалы EPAM, нажмите кнопку «Отменить подписку» в маркетинговом электронном письме, которое вы получили от нас.
                            </p>
                            <h5 className="services-sm-title mb-25">СБОР ИНФОРМАЦИИ</h5>
                            <p>
                                EPAM собирает информацию для предоставления более качественных услуг своим пользователям и лучшего понимания посетителей ее веб-сайтов и того, какой контент представляет для них интерес. EPAM собирает информацию следующими способами:
                                <br />
                                - информация, которую вы утвердительно решили предоставить нам (например, ваше имя, адрес электронной почты, название компании, должность, страна) для доступа к различным загрузкам, просмотра определенного контента, подписки на информационные бюллетени EPAM, регистрации на мероприятия и ваши предпочтения в получении маркетинговых материалов. от EPAM и ее сторонних партнеров, а также ваши предпочтения в общении и т. д. Информация, которую мы получили о вас из общедоступных источников, таких как социальные сети, маркетинговые платформы или мероприятия, которые вы посетили. Вы будете получать маркетинговые сообщения от EPAM, если вы запрашивали информацию у EPAM или если вы или ваш работодатель приобрели услуги у EPAM;
                                <br />
                                - информация, которую EPAM получает при использовании вами веб-сайтов EPAM, например, IP-адрес, тип браузера, интернет-провайдер, страницы перехода/выхода, тип платформы, отметка даты/времени, количество кликов, доменное имя и страна/штат всех посетителей веб-сайтов EPAM;
                                <br />
                                - информацию о местоположении, когда вы используете веб-сайты EPAM, поскольку EPAM может собирать и обрабатывать информацию о вашем местоположении. EPAM использует различные технологии и инструменты для определения местоположения;
                                <br />
                                - информация, которая считается агрегированными данными, такими как статистические или демографические данные, которые EPAM может использовать для любых целей. Агрегированные данные могут быть получены из вашей личной информации, но не считаются личной информацией по закону, поскольку они прямо или косвенно не раскрывают вашу личность, за исключением случаев, когда EPAM объединяет или связывает агрегированные данные с вашей личной информацией, чтобы они могли прямо или косвенно идентифицировать вас;
                                <br />
                                EPAM собирает технические данные от различных третьих лиц и общедоступных источников, таких как:
                                <br /> - провайдеры аналитики
                                <br />- рекламные сети
                                <br />- провайдеры поисковой информации

                            </p>
                            <p>
                                За исключением случаев, когда это требуется по закону, веб-сайты EPAM не собирают какие-либо специальные категории личной информации о вас (включая данные о вашей расе или этнической принадлежности, религиозных или философских убеждениях, сексуальной жизни, сексуальной ориентации, политических взглядах, членстве в профсоюзах, информацию о ваше здоровье и генетические и биометрические данные). EPAM не будет собирать информацию о судимостях и правонарушениях.
                            </p>
                            <p>
                                EPAM будет использовать вашу личную информацию только в тех целях, для которых она была собрана, за исключением случаев, когда она разумно считает, что ей необходимо использовать ее по другой причине, совместимой с первоначальной целью. Если EPAM потребуется использовать вашу личную информацию для несвязанной с этим цели, EPAM уведомит вас и объяснит правовую основу, позволяющую EPAM это делать.
                            </p>

                            <h5 className="services-sm-title mb-25">ОБМЕН ИНФОРМАЦИЕЙ</h5>
                            <p>
                                EPAM может раскрывать вашу личную информацию следующим категориям получателей:
                                <br />
                                - компаниям, входящим в ее группу, профессиональным консультантам, сторонним поставщикам услуг и партнерам, которые предоставляют EPAM услуги по обработке данных (например, для поддержки доставки, предоставления функций или помощи в повышении безопасности веб-сайтов EPAM) или которые иным образом обрабатывают личную информацию для целей, описанных в Уведомлении о конфиденциальности или уведомленных вами, когда EPAM собирает вашу личную информацию. Список текущих компаний группы EPAM предоставляется по запросу.
                                <br />
                                - любому компетентному правоохранительному органу, регулирующему органу, государственному учреждению, суду или другой третьей стороне, если EPAM считает, что раскрытие информации необходимо (a) в соответствии с применимым законодательством или нормативным актом, (b) для осуществления, установления или защиты своих законных прав, или ( в) для защиты своих жизненно важных интересов или интересов любого другого лица.
                                <br />
                                - любому другому лицу с вашего согласия на раскрытие.
                            </p>

                            <h5 className="services-sm-title mb-25">ПРАВОВАЯ ОСНОВА ОБРАБОТКИ</h5>
                            <p>
                                Если ваша личная информация защищена законодательством ЕС о защите данных, правовая основа для сбора и использования EPAM личной информации, описанной выше, будет зависеть от соответствующей личной информации и конкретного контекста, в котором EPAM ее собирает.
                            </p>
                            <p>
                                Тем не менее, EPAM, как правило, собирает личную информацию от вас только (а) в тех случаях, когда она нужна ей для выполнения контракта с вами, (б) когда обработка соответствует ее законным интересам и не нарушает ваши права, или (в) если у него есть на это ваше согласие. В некоторых случаях у EPAM также может быть юридическое обязательство собирать личную информацию от вас или она может нуждаться в личной информации иным образом для защиты ваших жизненно важных интересов или интересов другого лица.
                            </p>
                            <p>
                                Если у вас есть вопросы или вам нужна дополнительная информация о правовых основаниях, на которых EPAM собирает и использует вашу личную информацию, свяжитесь с EPAM, используя контактную информацию, указанную в разделе «Контактная информация» ниже и в правой колонке.
                            </p>

                            <h5 className="services-sm-title mb-25">ИСПОЛЬЗОВАНИЕ ИНФОРМАЦИИ</h5>
                            <p>
                                Любая информация, собираемая EPAM, будет обрабатываться в соответствии с настоящей Политикой конфиденциальности в целях принятия более эффективных бизнес-решений, поддержки выбранной вами деятельности и предоставления более качественных решений и услуг клиентам EPAM. EPAM использует информацию о вашем местоположении, чтобы адаптировать ваш опыт работы с веб-сайтами EPAM. Он также может использовать любую неличную информацию, собранную для улучшения веб-сайтов EPAM, и ваш IP-адрес для диагностики и администрирования веб-сайта. EPAM будет хранить вашу личную информацию только до тех пор, пока это необходимо для достижения целей, для которых она была собрана, в том числе для выполнения любых юридических требований, требований бухгалтерского учета или отчетности.
                            </p>
                            <p>
                                Чтобы определить надлежащий срок хранения личной информации, EPAM учитывает объем, характер и конфиденциальность личной информации, потенциальный риск причинения вреда в результате несанкционированного использования или раскрытия вашей личной информации, цели, для которых EPAM обрабатывает вашу личную информацию, и возможность он может достичь этих целей с помощью других средств и применимых требований законодательства.
                            </p>

                            <h5 className="services-sm-title mb-25">МЕЖДУНАРОДНЫЕ ПЕРЕВОДЫ</h5>
                            <p>
                                EPAM обрабатывает информацию на серверах во многих странах мира, и вы даете согласие на обработку вашей личной информации на сервере, расположенном за пределами страны, в которой вы проживаете. В этих странах могут действовать законы о защите данных, которые отличаются от законов вашей страны (и в некоторых случаях могут не обеспечивать такой защиты). Тем не менее, EPAM приняла соответствующие меры предосторожности, чтобы потребовать, чтобы ваша личная информация оставалась защищенной в соответствии с настоящей Политикой конфиденциальности, в том числе с использованием Стандартных договорных условий Европейской комиссии для передачи личной информации между компаниями ее группы, которые требуют, чтобы все компании группы защищали личную информацию. обработка информации из Европейской экономической зоны в соответствии со стандартом, эквивалентным стандарту, требуемому в соответствии с законодательством Европейского Союза о защите данных.
                            </p>

                            <h5 className="services-sm-title mb-25">ИНФОРМАЦИОННАЯ БЕЗОПАСНОСТИ</h5>
                            <p>
                                EPAM защищает вашу личную информацию так же, как и другую конфиденциальную информацию, например, храня ее на защищенных серверах, доступ к которым есть только у избранных сотрудников EPAM, и путем ее шифрования для предотвращения доступа посторонних лиц. EPAM внедрила процедуры для борьбы с любой утечкой личной информации и уведомит вас и любого применимого регулирующего органа о нарушении, когда это требуется по закону.
                            </p>

                            <h5 className="services-sm-title mb-25">ССЫЛКИ</h5>
                            <p>
                                Веб-сайты EPAM содержат ссылки, подключаемые модули и приложения на различные сторонние веб-сайты. Нажатие на эти ссылки или включение этих подключений может позволить третьим лицам собирать или передавать данные о вас. EPAM не контролирует и не несет ответственности за содержание, политику конфиденциальности или надежность таких сторонних подключений. Когда вы покидаете веб-сайт EPAM, EPAM рекомендует вам ознакомиться с уведомлением о конфиденциальности и политикой конфиденциальности каждого веб-сайта, который вы посещаете.
                            </p>

                            <h5 className="services-sm-title mb-25">ВАШИ ПРАВА НА ЗАЩИТУ ДАННЫХ</h5>
                            <p>
                                Если ваша личная информация защищена законодательством ЕС о защите данных, у вас есть следующие права на защиту данных, которые вы можете реализовать, связавшись с EPAM, используя контактную информацию, указанную в разделе «Контактная информация» ниже и в правой колонке:
                                <br />
                                - Если вы хотите получить доступ, исправить, обновить или запросить удаление вашей личной информации, вы можете сделать это в любое время, связавшись с EPAM.
                                <br />
                                - Кроме того, вы можете возразить против обработки вашей личной информации, попросить EPAM ограничить обработку вашей личной информации или запросить перенос вашей личной информации, связавшись с EPAM.
                                <br />
                                - Вы имеете право в любое время отказаться от маркетинговых сообщений, которые вам отправляет EPAM. Вы можете воспользоваться этим правом, щелкнув ссылку «отписаться» или «отказаться» в маркетинговых электронных письмах, которые EPAM отправляет вам, или воспользовавшись соответствующим механизмом отказа для маркетинга, не основанного на электронной почте.
                                <br />
                                - Аналогичным образом, если EPAM собрала и обработала вашу личную информацию на основании вашего согласия, вы можете отозвать свое согласие в любое время. Отзыв вашего согласия не повлияет на законность любой обработки EPAM, проведенной до вашего отзыва, а также не повлияет на обработку вашей личной информации, осуществляемую на законных основаниях для обработки, кроме согласия.
                                <br />
                                - Вы имеете право подать жалобу в орган по защите данных на сбор и использование вашей личной информации компанией EPAM. Для получения дополнительной информации обратитесь в местный орган по защите данных.
                            </p>
                            <p>
                                Вам не нужно будет платить за доступ к вашей личной информации (или за осуществление любых других прав). Однако EPAM может взимать разумную плату или отказать в выполнении вашего запроса, если ваш запрос является явно необоснованным, повторяющимся или чрезмерным. EPAM старается отвечать на все законные запросы в течение одного месяца. Иногда это может занять больше времени, если ваш запрос особенно сложный или вы сделали несколько запросов. В этом случае EPAM уведомит вас и будет держать в курсе.
                            </p>

                            <h5 className="services-sm-title mb-25">ФАЙЛЫ COOKIE</h5>
                            <p>
                                Вы можете настроить свой браузер так, чтобы он отказывался от всех или некоторых файлов cookie браузера или уведомлял вас, когда веб-сайты устанавливают или получают доступ к файлам cookie. Если вы отключите или откажетесь от файлов cookie, некоторые части веб-сайтов EPAM могут стать недоступными или работать неправильно. Дополнительную информацию о файлах cookie, которые использует EPAM, см. в Политике использования файлов cookie EPAM.
                            </p>

                            <h5 className="services-sm-title mb-25">ИЗМЕНЕНИЯ В ПОЛИТИКЕ</h5>
                            <p>
                                EPAM оставляет за собой право время от времени изменять или дополнять настоящую Политику конфиденциальности по своему усмотрению. Изменения можно посмотреть здесь или в другом месте на веб-сайтах EPAM. Ваше дальнейшее использование веб-сайтов EPAM означает ваше согласие с этими изменениями.
                            </p>

                            <h5 className="services-sm-title mb-25">КОНТАКТНАЯ ИНФОРМАЦИЯ</h5>
                            <p>
                                Важно, чтобы имеющаяся у EPAM личная информация о вас была точной и актуальной. Пожалуйста, информируйте EPAM, если ваша личная информация изменится во время ваших отношений с EPAM. Кроме того, если у вас есть какие-либо вопросы относительно настоящей Политики конфиденциальности, практики веб-сайтов EPAM или вашего взаимодействия с EPAM через веб-сайты EPAM, обращайтесь по адресу:
                            </p>
                            <p>
                                EPAM Systems, Inc. <br />
                                Юниверсити Драйв, 41, офис 202 <br />
                                Ньютаун, Пенсильвания, 18940 <br />
                                Т: +1-267-759-9000 <br />
                                Ф: +1-267-759-8989 <br />
                                Электронная почта: privacy@epam.com <br />
                            </p>
                        </div>
                    </div>
                </div>
            </div >
            {/*Footer  */}
            < Footer />

        </>
    );
};

export default Privacy;