export const jobListData = [
    {
        id: 1,
        title: 'React разработчик',
        subtitle: 'Удаленная работа',
        url: 'react-developer',
        salary: '1000$',
        offer: [
            "Работа из дома.",
            "Достойную оплату, оформление по ТК, оплата переработок.",
            "Интересные задачи, которые помогают развиваться.",
            "Карьерный и профессиональный рост.",
            "Оплата литературы, семинаров, конференций для профессионального развития.",
            "Дружный коллектив без лишних формальностей и субординаций."
        ],
        requirements: [
            "Иметь реальный опыт работы front - end разработчиком от 3 - х лет.",
            "JS, HTML5, CSS3.",
            "Опыт работы с классовыми компонентами и хуками React.",
            "Опыт работы с Typescript, Webpack, git.",
            "CSS - препроцессор SCSS.",
            "Быть перфекционистом в лучшем значении этого слова.Каждая мелочь имеет значение, работу надо не просто сделать, а сделать на отлично."
        ]
    },
    {
        id: 2,
        title: 'Backend разработчик',
        subtitle: 'Удаленная работа',
        url: 'backend-developer',
        salary: '1100$',
        offer: [
            "Обучение.",
            "Удаленная работа.",
            "Дружный коллектив.",
            "Комфортные рабочие условия.",
            "Постоянное повышение Скила."
        ],
        requirements: [
            "Опыт Node.js от 2 лет.",
            "Базы данных postgreSQL, MySQL, redis.",
            "Знакомство с инфраструктурой: Linux, Docker, Nginx.",
            "Умение работать с git, системами сборки и деплоя (gitlab, CI/CD).",
            "Умение давать оценку сроков выполнения задач и соблюдать их, вовремя сигнализировать о проблемах.",
            "Навыки документирования кода.",
            "Огромное желание расти и развиваться профессионально"
        ]
    },
    {
        id: 3,
        title: 'SEO специалист',
        subtitle: 'Удаленная работа',
        url: 'seo-specialist',
        salary: '850$',
        offer: [
            "Широкий выбор необходимых инструментов и ресурсов для успешного ведения проектов.",
            "Обучение за счёт компании, посещение профильных конференций, проходящих в России и странах ближнего зарубежья.",
            "Собственное развитие и повышение Вашей квалификации в сфере интернет-технологий и IT. Вы станете частью профессиональной и предприимчивой команды, стремящейся стать лидером на рынке интернет-технологий."
        ],
        requirements: [
            "Понимание основ сайтостроения и основных каналов привлечения трафика.",
            "Опыт работы с программами Key Collector, Netpeak Spider или Screaming Frog.",
            "Умение составлять семантическое ядро без мусора и распределять запросы по группам.",
            "Понимание того, как работают поисковые системы и какие есть факторы, влияющие на ранжирование.",
            "Желателен опыт работы с покупкой ссылок или другими способами их получения.",
            "Грамотный письменный русский язык, умение просто и понятно излагать свои мысли"
        ]
    },
    {
        id: 4,
        title: 'React native разработчик',
        subtitle: 'Удаленная работа',
        url: 'react-native-developer',
        salary: '1150$',
        offer: [
            "Интересная работа в стабильной и активно развивающейся компании.",
            "Молодой, дружный коллектив.",
            "Участие в больших и амбициозных проектах.",
            "Прогрессивная система оплаты труда"
        ],
        requirements: [
            "Уверенные знания JavaScript ES6.",
            "Знание и понимание React / React Native и Redux.",
            "Понимание DOM management, Virtual DOM.",
            "Опыт работы с клиент-серверными приложениями (REST API, JSON).",
            "Практическое знание Git.",
            "Опыт публикации приложений iOS / Android",
            "Понимание шаблонов ООП (design patterns) и принципов SOLID.",
            "Умение быстро осваивать новые технологии.",
            "Вовлеченность в развитие проекта"
        ]
    }
]