const servicesData = [
  {
    id: 1,
    icon: "flaticon-web-programming",
    title: 'Веб-сайты',
    url: 'web-sites',
    text: 'Создание и разработка сайтов с индивидуальным дизайном по доступным ценам.',
    description:
      <>
        <p className="services-text mb-40">Как профессиональные веб-разработчики и дизайнеры веб-сайтов, мы предоставляем лучшие услуги веб-разработки. От понимания ваших бизнес-целей при создании идеального решения для веб-разработки до оптимизации коэффициента конверсии и отслеживания посетителей, наша команда тесно сотрудничает с вами на каждом этапе проекта, чтобы убедиться, что вы достигаете своих бизнес-целей с помощью своего веб-сайта. Будучи известной компанией, занимающейся веб-разработкой и дизайном, мы представляем лучших веб-дизайнеров и разработчиков, которые разрабатывают впечатляющие веб-сайты, привлекающие потенциальных клиентов, которые соответствуют бизнес-требованиям наших клиентов.
        </p>
      </>,
    steps: [
      {
        title: "Стратегия",
        text: "Составление комплексного предложения"
      },
      {
        title: "Дизайн",
        text: "Разработка пользовательского интерфейса"
      },
      {
        title: "Разработка",
        text: "Front и Back-End разработка"
      },
      {
        title: "Запуск",
        text: "Размещение сайта на сервере"
      }
    ]
  },
  {
    id: 2,
    icon: "flaticon-web-programming",
    title: 'Интернет-магазины',
    url: 'online-shops',
    text: 'Обладает всем функционалом для демонстрации и продажи товаров/услуг в Интернете.',
    description:
      <>
        <p className="services-text mb-40">Каждый бизнес уникален. У каждого свои бизнес-модели, цели и целевые клиенты. Это означает, что точки фокусировки различаются. Поэтому процесс разработки необходимо адаптировать в соответствии с потребностями вашего бизнеса. Мы понимаем это и планируем процесс разработки в соответствии с вашим бизнесом. На начальных этапах взаимодействия мы уделяем время анализу вашего бизнеса и пониманию основных проблем клиентов, чтобы предоставить уникальный опыт электронной коммерции, который оценят ваши клиенты.
        </p>
      </>,
    steps: [
      {
        title: "Стратегия",
        text: "Составление комплексного предложения"
      },
      {
        title: "Дизайн",
        text: "Разработка пользовательского интерфейса"
      },
      {
        title: "Разработка",
        text: "Front и Back-End разработка"
      },
      {
        title: "Запуск",
        text: "Размещение сайта на сервере"
      }
    ]
  },
  {
    id: 3,
    icon: "flaticon-coding",
    title: 'Мобильная разработка',
    url: 'mobile-development',
    text: 'Полный цикл разработки мобильных приложений под все операционные системы.',
    description:
      <>
        <p className="services-text mb-10">Поскольку мы входим в число ведущих компаний-разработчиков мобильных приложений, наша команда стремится создавать для наших клиентов возможности, позволяющие им общаться с людьми, а также добиваться значимых результатов для своей организации. От концептуализации до монетизации и каждого промежуточного процесса мы предоставим вам широкий спектр цифровых услуг, которые помогут вам расти.
        </p>
        <p className="services-text mb-10">
          Мы обязуемся создавать простые и привлекательные мобильные приложения для таких платформ, как Android, iOS и других. Наш опыт заключается в нашей команде профессиональных и талантливых дизайнеров, разработчиков, бизнес-аналитиков и маркетологов, которые обслуживали клиентов из разных уголков мира, чтобы добавить к нашему опыту.
        </p>
        <ul className="mb-40">
          <li className="mb-10">
            Разработка iOS-приложений
            Если вы ищете разработку приложений для iPhone или хотите создать приложение, которое эффективно работает на всех устройствах, у нас есть сертифицированные разработчики, которые помогут вам от проектирования до развертывания и обслуживания. Наши первоклассные разработчики обеспечивают лучшую разработку приложений для iOS, следуя подходу, ориентированному на ценность, и процессу сборки за сборкой.
          </li>
          <li className="mb-10">Разработка приложений для Android
            Наши увлеченные своим делом разработчики предоставляют передовые услуги по разработке приложений для Android, используя лучшие практики UI/UX, новейшие технологии и фреймворки для создания динамичных мобильных приложений для платформы Android.
          </li>
          <li className="mb-10">
            Кроссплатформенная разработка приложений
            Наша команда входит в число ведущих компаний по разработке мобильных приложений. У нас есть опытная команда разработчиков кросс-платформенных приложений, которые обеспечивают беспрепятственный доступ к вашему мобильному приложению на различных платформах.
          </li>
          <li className="mb-10">
            Универсальное место для всех услуг по разработке мобильных приложений
            Наша способность понимать столь необходимые отраслевые предпосылки возглавила нашу позицию среди ведущих компаний-разработчиков мобильных приложений. Мы предлагаем комплексные услуги по разработке мобильных приложений, от дизайна UI/UX до разработки и развертывания, чтобы превратить ваши уникальные идеи в инновационные мобильные приложения, которые изменят будущее. При поддержке специальной команды опытных разработчиков мобильных приложений мы разрабатываем комплексные высококачественные мобильные приложения, соответствующие ожиданиям наших клиентов.
          </li>
        </ul>
      </>,
    steps: [
      {
        title: "Стратегия",
        text: "Составление комплексного предложения"
      },
      {
        title: "Дизайн",
        text: "Разработка пользовательского интерфейса"
      },
      {
        title: "Разработка",
        text: "Front и Back-End разработка"
      },
      {
        title: "Запуск",
        text: "Публикация приложения"
      }
    ]
  },
  {
    id: 4,
    icon: "flaticon-seo",
    title: 'SEO оптимизация',
    url: 'seo-optimization',
    text: 'SEO продвижение сайта. Собственные авторские стратегии SEO продвижения.',
    description:
      <>
        <p className="services-text mb-10">
          SEO (Search Engine Optimization) – это технология раскрутки сайта в поисковой выдаче с целью получения трафика. В основе работы лежит знание алгоритмов ранжирования ресурсов в выдаче и улучшение критериев сайта с целью выведения его в топ результатов поиска по требуемым ключевым фразам.
        </p>
        <p className="services-text mb-10">
          В результате проведения качественного SEO сайт поднимается в выдаче поисковика, а значит, по ссылке на продвигаемую страницу идет трафик посетителей, который будет тем больше, чем выше позиция такой ссылки.
        </p>
        <p className="services-text mb-10">
          Принцип работы выглядит очень просто: пользователь вводит интересующий его запрос, а поисковая система строит список ссылок на ресурсы в определенном порядке. После этого потенциальный клиент знакомится с кратким описанием ресурса и переходит на него, если это его заинтересовало. Чем выше в результатах находится такая ссылка, тем вероятнее переход, поскольку пользователь обычно не заходит дальше первой страницы выдачи.
        </p>
        <p className="services-text mb-40">
          Принцип построения поисковой выдачи по запросу использует сложную формулу сортировки, учитывающую десятки параметров. При этом точный алгоритм такого ранжирования не разглашается владельцами поисковых систем, которые озвучивают только общие принципы построения качественного и полезного для людей ресурса, помогающие подняться в топ. На практике без использования технологий SEO-продвижения практически невозможно вывести сайт на первую страницу выдачи в высококонкурентных коммерческих тематиках, даже если его контент и техническая реализация будут идеальны.
        </p>
      </>,
    steps: [
      {
        title: "Анализ",
        text: "Анализ тематики и конкурентов"
      },
      {
        title: "Ядро",
        text: "Формирование семантического ядра"
      },
      {
        title: "Структура",
        text: "Формирование структуры сайта"
      },
      {
        title: "Контент",
        text: "Оптимизация контента"
      }
    ]
  }
]

export default servicesData;